# TextRange Constructor (Int32, Int32) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextRange Constructor (Int32, Int32)
TextRange Class See Also
---
Constructs a TextRange with input start and length.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public TextRange(
	int start,
	int length
)
```

Visual Basic
---
```text
Public Sub New ( _
	start As Integer, _
	length As Integer _
)
```

Visual C++
---
```text
public:
TextRange(
	int start,
	int length
)
```

# ### Parameters
start
    Type: System..::..Int32
length
    Type: System..::..Int32
# Remarks
The input value for start as well as length should not be negative.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The given value for start is negative. -or- The given value for length is negative. |

# See Also
TextRange Class
TextRange Overload
Autodesk.Revit.DB Namespace